/*
변수는 크게 전역변수와 지역변수로 나뉜다.

전역변수는 全域變數 모든 지역에 접근할 수 있는 별명(변수)
            모두 전
            지역 역
            변할 변
            셀   수



지역변수 地域變數 지방 지역에 접근할 수 있는 별명
                지방내에 있는 모든지역에서만 접근가능, 외부로는 접근 불가
        땅   지
        지역 역
        변할 변
        셀   수

[] = 대괄호  ==> 특정 수, 글자들을 나열하고 정의를 내릴때 사용
            ex ) [사과, 포도, 오렌지, 딸기]
{} = 중괄호  ==> 기능을 설정할 때 사용
            ex ) {}작성을 하면 중괄호 안을 비우면 안됨.
() = 소괄호  ==> 기능명칭 뒤에 특정 값을 호출할 때 사용
            ex ) function 인사하기(:대표님한테만"){}

            [],()는 안에 값이 설정되어 있지 않아도 됨.
*/
